{
    " ": 1,
    ":": 2,
    "?": 3,
    "ሀ": 4,
    "ሁ": 5,
    "ሂ": 6,
    "ሃ": 7,
    "ሄ": 8,
    "ህ": 9,
    "ሆ": 10,
    "ለ": 11,
    "ሉ": 12,
    "ሊ": 13,
    "ላ": 14,
    "ሌ": 15,
    "ል": 16,
    "ሎ": 17,
    "ሏ": 18,
    "ሐ": 19,
    "ሑ": 20,
    "ሓ": 21,
    "ሔ": 22,
    "ሕ": 23,
    "መ": 24,
    "ሙ": 25,
    "ሚ": 26,
    "ማ": 27,
    "ሜ": 28,
    "ም": 29,
    "ሞ": 30,
    "ሟ": 31,
    "ሠ": 32,
    "ሡ": 33,
    "ሣ": 34,
    "ሥ": 35,
    "ሦ": 36,
    "ረ": 37,
    "ሩ": 38,
    "ሪ": 39,
    "ራ": 40,
    "ሬ": 41,
    "ር": 42,
    "ሮ": 43,
    "ሯ": 44,
    "ሰ": 45,
    "ሱ": 46,
    "ሲ": 47,
    "ሳ": 48,
    "ሴ": 49,
    "ስ": 50,
    "ሶ": 51,
    "ሷ": 52,
    "ሸ": 53,
    "ሹ": 54,
    "ሺ": 55,
    "ሻ": 56,
    "ሼ": 57,
    "ሽ": 58,
    "ሾ": 59,
    "ቀ": 60,
    "ቁ": 61,
    "ቂ": 62,
    "ቃ": 63,
    "ቄ": 64,
    "ቅ": 65,
    "ቆ": 66,
    "ቋ": 67,
    "በ": 68,
    "ቡ": 69,
    "ቢ": 70,
    "ባ": 71,
    "ቤ": 72,
    "ብ": 73,
    "ቦ": 74,
    "ቧ": 75,
    "ቨ": 76,
    "ቪ": 77,
    "ቫ": 78,
    "ቭ": 79,
    "ቮ": 80,
    "ተ": 81,
    "ቱ": 82,
    "ቲ": 83,
    "ታ": 84,
    "ቴ": 85,
    "ት": 86,
    "ቶ": 87,
    "ቷ": 88,
    "ቸ": 89,
    "ቹ": 90,
    "ቺ": 91,
    "ቻ": 92,
    "ቼ": 93,
    "ች": 94,
    "ቾ": 95,
    "ቿ": 96,
    "ኃ": 97,
    "ኅ": 98,
    "ኋ": 99,
    "ነ": 100,
    "ኑ": 101,
    "ኒ": 102,
    "ና": 103,
    "ኔ": 104,
    "ን": 105,
    "ኖ": 106,
    "ኗ": 107,
    "ኘ": 108,
    "ኙ": 109,
    "ኛ": 110,
    "ኝ": 111,
    "ኞ": 112,
    "ኟ": 113,
    "አ": 114,
    "ኡ": 115,
    "ኢ": 116,
    "ኣ": 117,
    "ኤ": 118,
    "እ": 119,
    "ኦ": 120,
    "ከ": 121,
    "ኩ": 122,
    "ኪ": 123,
    "ካ": 124,
    "ኬ": 125,
    "ክ": 126,
    "ኮ": 127,
    "ኳ": 128,
    "ኸ": 129,
    "ኽ": 130,
    "ወ": 131,
    "ዊ": 132,
    "ዋ": 133,
    "ዌ": 134,
    "ው": 135,
    "ዎ": 136,
    "ዐ": 137,
    "ዑ": 138,
    "ዒ": 139,
    "ዓ": 140,
    "ዕ": 141,
    "ዖ": 142,
    "ዘ": 143,
    "ዙ": 144,
    "ዚ": 145,
    "ዛ": 146,
    "ዜ": 147,
    "ዝ": 148,
    "ዞ": 149,
    "ዢ": 150,
    "ዣ": 151,
    "ዤ": 152,
    "ዥ": 153,
    "ዦ": 154,
    "የ": 155,
    "ዩ": 156,
    "ያ": 157,
    "ዬ": 158,
    "ይ": 159,
    "ዮ": 160,
    "ደ": 161,
    "ዱ": 162,
    "ዲ": 163,
    "ዳ": 164,
    "ዴ": 165,
    "ድ": 166,
    "ዶ": 167,
    "ዷ": 168,
    "ጀ": 169,
    "ጁ": 170,
    "ጂ": 171,
    "ጃ": 172,
    "ጄ": 173,
    "ጅ": 174,
    "ጆ": 175,
    "ገ": 176,
    "ጉ": 177,
    "ጊ": 178,
    "ጋ": 179,
    "ጌ": 180,
    "ግ": 181,
    "ጎ": 182,
    "ጓ": 183,
    "ጠ": 184,
    "ጡ": 185,
    "ጣ": 186,
    "ጤ": 187,
    "ጥ": 188,
    "ጦ": 189,
    "ጧ": 190,
    "ጨ": 191,
    "ጪ": 192,
    "ጫ": 193,
    "ጭ": 194,
    "ጮ": 195,
    "ጴ": 196,
    "ጵ": 197,
    "ጸ": 198,
    "ጹ": 199,
    "ጺ": 200,
    "ጻ": 201,
    "ጽ": 202,
    "ጾ": 203,
    "ጿ": 204,
    "ፀ": 205,
    "ፁ": 206,
    "ፃ": 207,
    "ፅ": 208,
    "ፈ": 209,
    "ፉ": 210,
    "ፊ": 211,
    "ፋ": 212,
    "ፌ": 213,
    "ፍ": 214,
    "ፎ": 215,
    "ፏ": 216,
    "ፒ": 217,
    "ፓ": 218,
    "ፔ": 219,
    "ፕ": 220,
    "ፖ": 221,
    "፡": 222,
    "።": 223,
    "፣": 224,
    "“": 225,
    "”": 226,
    "<pad>": 0,
    "<unk>": 227
}